3 - Topologia/Resumen.tex
% Created 2019-09-16 Mon 21:48
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 11pt]{extarticle}
             \usepackage[utf8]{inputenc}
\usepackage[left=2cm, right=2cm, bottom=2.5cm, top=2.5cm]{geometry}
% Paquetes de matemáticas
\usepackage{amsmath, amsfonts, amssymb, commath}
\usepackage{tikz}
\newcommand{\tikzcircle}[2][red,fill=red]{\tikz[baseline=-0.5ex]\draw[#1,radius=#2] (0,0) circle ;}%
% Ajustes de idioma, gráficos, etc
\usepackage{adjustbox}
\usepackage{float}
\usepackage{hyperref}
\usepackage{graphicx}
\usepackage{gensymb}
\usepackage[spanish, english]{babel}
\usepackage{multicol}
\usepackage{listings}
\usepackage{enumitem}
\usepackage{booktabs}
\usepackage{xcolor}
\usepackage{wrapfig}
%Fuentes.
% Alegreya tiene este toque antiguo con serifa, y la tipografía de las ecuaciones es también interesante.
% Gillius no tiene serifa, y también es equilibrada.
\usepackage[T1]{fontenc}
%\usepackage[default]{gillius}
\usepackage{newpxtext, newpxmath}
% Paquete para añadir Creative Commons al final del documento
\usepackage[
type={CC},
modifier={by-nc-nd},
version={3.0},
]{doclicense}
% Propiedades de párrafo
\setlength{\parindent}{0em}
\setlength{\parskip}{1.1em}
\renewcommand{\baselinestretch}{1.05}
\setlength\itemsep{0em}
% Definición de comandos. Muchos de ellos han surgido para Geometría, aunque se
% irá actualizando la lista. POSIBLEMENTE LO INTRODUZCA COMO COMANDOS DE ORG
\newcommand{\m}{\text{medio}}
\newcommand{\iso}{\text{Isom}}
% Para incluir mathcal en las ecuaciones. El /mathcal para Alegreya es el viejo
% y floritural estilo que odio.
\usepackage{calrsfs}
\DeclareMathAlphabet{\pazocal}{OMS}{zplm}{m}{n}
% Definición de colores agradables a la vista
\definecolor{azul}{HTML}{107896}
\definecolor{naranja}{HTML}{C2571A}
\definecolor{rojo}{HTML}{9A2617}
\definecolor{amarillo}{HTML}{BCA136}
\definecolor{verde}{HTML}{829356}
\definecolor{gris}{HTML}{909090}
\definecolor{rosa}{HTML}{F9A7B0}
\definecolor{amarillochillon}{HTML}{FBB117}
% Definición de comandos para teoremas, etc. El comando también incluye
% como argumento un texto, del estilo Teorema 3.5
\newcommand{\axioma}[1]{\textcolor{naranja}{\textbf{Axioma #1}}}
\newcommand{\tma}[1]{\textcolor{rojo}{\textbf{Teorema #1}}}
\newcommand{\propo}[1]{\textcolor{rojo}{\textbf{Proposición #1}}}
\newcommand{\defi}[1]{\textcolor{azul}{\textbf{Definición #1}}}
\newcommand{\obs}[1]{\textcolor{verde}{\textbf{Observación #1}}}
\newcommand{\ejem}[1]{\textcolor{verde}{\textbf{Ejemplo #1}}}
\newcommand{\ej}[1]{\textcolor{amarillo}{\textbf{Ejercicio #1}}}
\newcommand{\lema}[1]{\textcolor{rosa}{\textbf{Lema #1}}}
\newcommand{\cor}[1]{\textcolor{rosa}{\textbf{Corolario #1}}}
% La demostración es igual pero va con una letra más pequeña y en gris.
\newcommand{\dem}[1]{\textcolor{gris}{\small{Demostración. #1}}}
% Esto pone un triangulito de peligro para cuando algo es importante.
\newcommand{\importante}{\tikzcircle[amarillo, fill=amarillo]{4pt}\,}
% Para usar columnas emplea este trozo de código
% \begin{multicols*}{2}
% [\section{Axiomas para la geometría euclidiana plana}]
% \input{2.tex}\end{multicols*}\pagebreak
% multicols* obliga a terminar una columna antes de empezar la siguiente.
\DeclareMathAlphabet{\pazocal}{OMS}{zplm}{m}{n}
\let\mathcal\pazocal
\usepackage{fancyhdr}
\pagestyle{fancy}
\lhead{Alex Martínez Ascensión}
\chead{}
\rhead{\today}
\date{}
\title{\Huge\vspace{-1em}Topología}
\hypersetup{
 pdfauthor={},
 pdftitle={\Huge\vspace{-1em}Topología},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.2.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\vspace{-8em}

\section{Espacios topológicos}
\label{sec:orge9ffd63}
Se dice que \(p\) es el límite de una sucesión de reales \(a_1, \cdots, a_n\) cuando, para todo abierto \(p - \epsilon, p + \epsilon\), existe un \(m\)
tal que para todo \(n \ge m\) se cumple que \(a_n \in (p- \epsilon, p +
\epsilon)\). 

Esta noción de intervalo se unifica en el concepto \textbf{bola}, y se define la familia
de intervalos de un punto \(p\), \(B(p)\). Sea \(X\) no vacío, para cada
\(p \in X\) existe una familia \(B(p)\). Se dice que \(B(p)\) es una \textbf{base
de entornos abiertos} de \(p\) si todas las familias \(B(p)\) verifican:
\begin{itemize}
\item B1: si \(U \subset B(p)\), entonces \(p \in U\).
\item B2: si \(U \in B(p)\) y \(V \in B(p)\), existe \(W \in B(p)\) tal que \(W \subset U \cap V\).
\item B3: si \(U \in B(p)\), para todo \(q \in U\) existe \(V \in B(q)\) tal
que \(V \subset U\).
\end{itemize}

Esta generalización de conjuntos \((p - \epsilon, p+\epsilon\) nos simplifica
y permite expandir la definición de topología, independientemente de una métrica
o distancia.

Se llama un \textbf{espacio métrico} \((X,d)\) a un conjunto \(X\) con una distancia
\(d\) definida en él. En un espacio métrico se llama \textbf{bola abierta} de centro
\(p\) y radio \(r\) al conjunto \(E(p,r) = \{ t \in X \;|\; d(p,t) < r \}\).
Las familias \(B(p)\) de todas las bolas con radios reales cumplen los puntos
B1, B2 y B3, por lo que constituyen base de entornos abiertos en \((X,d)\).

Si \(X\) es un conjunto en el que se ha definido un sistema de bases de
entornos abiertos \(B(p)\), un subconjunto \(A \subset X\) es un \textbf{conjunto abierto} cuando es \(\emptyset\) o cuando para cada \(t \in A\) existe un subconjunto \(U \in B(t)\) tal que \(U \subset A\).

Se llama \textbf{topología \(T\) del conjunto \(X\)} a la familia de conjuntos
abietos de \(X\) definidos por bases de entornos abiertos \(B(p)\).

Por ejemplo, en \(\mathbb{R}\) la topología usual (\(T_u\)) viene dada por \(B(p) =
(p - \epsilon, p + \epsilon)\). En esta topología, \((\mathbb{R}, T_u)\),
cada intervalo abierto \((a,b)\) viene dado como \(B(t), t = \frac{a+b}{2}\). El intervalo \([a,b)\) no es abierto, pues para \(a\) no existe ningún
conjunto \(U \in B(a)\) tal que \(U \subset [a,b)\).

Dos sistemas de bases de entornos abiertos, \(B(p), B'(p)\) son \textbf{equivalentes}
cuando determinan la misma topología \(T\) en \(X\); es decir, que para cada
\(U \in B(p)\) existe un \(U' \in B'(p)\) tal que \(U \subset U'\) y que para cada \(V' \in B'(p)\) exista un \(V \in B(p)\) tal que \(V'
\subset V\).

\subsection{Propiedades de una topología}
\label{sec:org9b6d60a}
Sea un conjunto \(X\) en un sistema \(B(p)\). La topología \(T\)
determinada por \(B(p)\) en \(X\) cumple:
\begin{itemize}
\item P1: \(\emptyset \in T\) y \(X \in T\).
\item P2: Dada una familia de abiertos \(U_\lambda, \lambda \in L\) de \(T\), la
unión de los elementos, \(\bigcup_{\lambda} U_\lambda\) es un elemento de \(T\).
\item P3: Dada una familia \textbf{finita} \(U_i, i=1, \cdots, n\) de elementos de \(T\), la
intersección de los elementos, \(\bigcap_{i=1}^{n}U_i\) es un elemento de \(T\).
\end{itemize}

Un \textbf{espacio topológico} \((X, T)\) es un conjunto no vacío con una topología
definida en él. Una familia de subconjuntos de \(X\), \(H(p)\) para cada \(p \in X\) [SEAN DISCRETOS O CONTINUOS], si
cumple P1, P2, P3 entonces, las familias \(H\) forman una topología \(T\) en
\(X\). Si para esa topología existe una métrica \(d\), entonces decimos que
es una \textbf{topología metrizable}.

Si \(T, T'\) son dos topologías de \(X\), y \(T \subset T'\), entonces se dice que \(T\) es menos \textbf{fina} que \(T'\). La topología más
fina de todas es la \textbf{topología trivial}, dada por \(\{ \emptyset, X \}\), y la
menos fina, o \textbf{discreta}, está dada por \(\mathcal{P}(X)\), es decir, el
conjunto partición de \(X\). 

En \((X, T)\) se llama \textbf{conjunto cerrado} a un conjunto \(M \subset X\) tal que \(X-M\) es abierto. Una familia de conjuntos cerrados es \((X,T)\) verifica:
\begin{itemize}
\item C1: \(\emptyset \in T\) y \(X \in T\) son cerrados.
\item C2: Dada una familia \textbf{finita} de cerrados \(M_\lambda, \lambda \in L\) de \(T\), la
unión de los elementos, \(\bigcup_{\lambda} M_\lambda\) es un cerrado.
\item C3: Dada una familia \(M_\lambda, \lambda \in L\) de elementos de \(T\), la
intersección de los elementos, \(\bigcap_{L}U_\lambda\) es un elemento de \(T\).
\end{itemize}

Si \((X,T)\) es un estacio topológico y \(M \subset X\), la topología \(T_M = \{ M \cap U \}\) de las intersecciones de \(M\) con
abiertos \(U\) de \((X,T)\) se llama \textbf{topología inducida o subordinada} de \(T\). Así, el espacio \(M, T_M\) es un subespacio de \((X,T)\).

\section{Base de una topología}
\label{sec:orged84d1b}
Dada una topología \(T\) en \(X\), la \textbf{base de la topología}, \(B\), es una
familia de conjuntos tal que cualquier abierto no vacío \(U \subset T\) es una unión de elementos de \(B\). \(\forall U \subset
T\;,\; U = \cup_{i} B_i\)

Sea \(X\) un conjunto y \(F = \{ A_\lambda \}_{\lambda \in L}\) una familia
de subconjuntos de \(X\). Una condución necesaria y suficiente para que \(F\) sea base de \(X\) es:
\begin{itemize}
\item I: \(\bigcup_{\lambda}^{}\{ A_\lambda \} = X\)
\item II: Si \(A_\lambda, A_\mu\) son dos elementos de \(F\), y \(A_\lambda
  \cap A_\mu \neq \emptyset\), para cualquier punto \(t \in  A_\lambda
  \cap A_\mu\) existe \(A_\nu \in F\) tal que \(t \in A_\nu\)
\end{itemize}


\subsection{1er y 2º axioma de numerabilidad}
\label{sec:org77abf5c}
Un espacio \((X,T)\) verifica el 1er axioma de numerabilidad si para todo \(x
\in X\) existe una base de entornos de \(x\) que sea numerable. Un espacio 
\((X,T)\) verifica el 2º axioma de numerabilidad cuando su topología
tiene una base numerable.

\subsection{Topología engendrada for una familia de subconjuntos}
\label{sec:orgc05b552}

Cualquier familia \(\{ A_\lambda \}\) de \(X\) que cumpla I es una subase de
una topología de \(X\). Si \(H = \{ A_\lambda \}\) cumple I y II, la familia \(B\) formada por las intersecciones (y uniones) finitas de \(H\) es base para alguna
topología de \(X\) y se llama \textbf{topología engendrada}. 
\end{document}